# Taps
tap 'caskroom/cask'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install various binaries
brew 'readline'
brew 'bash'
brew 'git'
brew 'carthage'
brew 'cmake'
brew 'cocoapods'
brew 'coreutils'
brew 'gdbm'
brew 'go'
brew 'libyaml'
brew 'makedepend'
brew 'openssl'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'sqlite'
brew 'xz'
brew 'python3'
brew 'ruby'
brew 'vim', args: ['with-python3', 'without-python']
brew 'wget'
brew 'zsh'

# Apps
cask '1password'
cask 'caffeine'
cask 'colorpicker'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'licecap'
cask 'macdown'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
