# Taps
tap 'caskroom/cask'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install various binaries
brew 'bash'
brew 'git'
brew 'python'
brew 'vim'

# Apps
cask '1password'
cask 'caffeine'
cask 'colorpicker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'viber'
cask 'vlc'
